{"class_name": "Sequential", "keras_version": "1.0.8", "config": [{"class_name": "Merge", "config": {"layers": [{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 24, "activation": "relu", "input_dtype": "float32", "b_regularizer": null, "W_regularizer": null, "nb_row": 5, "batch_input_shape": [null, 3, 120, 160], "border_mode": "same"}}, {"class_name": "SpatialDropout2D", "config": {"p": 0.5, "trainable": true, "name": "spatialdropout2d_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 36, "b_regularizer": null, "W_regularizer": null, "nb_row": 5, "activation": "relu", "border_mode": "same"}}, {"class_name": "SpatialDropout2D", "config": {"p": 0.5, "trainable": true, "name": "spatialdropout2d_2"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 48, "b_regularizer": null, "W_regularizer": null, "nb_row": 5, "activation": "relu", "border_mode": "same"}}, {"class_name": "SpatialDropout2D", "config": {"p": 0.5, "trainable": true, "name": "spatialdropout2d_3"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}}, {"class_name": "SpatialDropout2D", "config": {"p": 0.5, "trainable": true, "name": "spatialdropout2d_4"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_6", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 24, "activation": "relu", "input_dtype": "float32", "b_regularizer": null, "W_regularizer": null, "nb_row": 5, "batch_input_shape": [null, 3, 120, 160], "border_mode": "same"}}, {"class_name": "SpatialDropout2D", "config": {"p": 0.5, "trainable": true, "name": "spatialdropout2d_5"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_7", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 36, "b_regularizer": null, "W_regularizer": null, "nb_row": 5, "activation": "relu", "border_mode": "same"}}, {"class_name": "SpatialDropout2D", "config": {"p": 0.5, "trainable": true, "name": "spatialdropout2d_6"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_8", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 48, "b_regularizer": null, "W_regularizer": null, "nb_row": 5, "activation": "relu", "border_mode": "same"}}, {"class_name": "SpatialDropout2D", "config": {"p": 0.5, "trainable": true, "name": "spatialdropout2d_7"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_9", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}}, {"class_name": "SpatialDropout2D", "config": {"p": 0.5, "trainable": true, "name": "spatialdropout2d_8"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_10", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_11", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 24, "activation": "relu", "input_dtype": "float32", "b_regularizer": null, "W_regularizer": null, "nb_row": 5, "batch_input_shape": [null, 3, 120, 160], "border_mode": "same"}}, {"class_name": "SpatialDropout2D", "config": {"p": 0.5, "trainable": true, "name": "spatialdropout2d_9"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_12", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 36, "b_regularizer": null, "W_regularizer": null, "nb_row": 5, "activation": "relu", "border_mode": "same"}}, {"class_name": "SpatialDropout2D", "config": {"p": 0.5, "trainable": true, "name": "spatialdropout2d_10"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_13", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 48, "b_regularizer": null, "W_regularizer": null, "nb_row": 5, "activation": "relu", "border_mode": "same"}}, {"class_name": "SpatialDropout2D", "config": {"p": 0.5, "trainable": true, "name": "spatialdropout2d_11"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_14", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}}, {"class_name": "SpatialDropout2D", "config": {"p": 0.5, "trainable": true, "name": "spatialdropout2d_12"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_15", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3"}}]}], "name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 1164}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 100}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 50}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 10}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_5", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 1}}]}